---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.ModelLine
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.ModelLine

Creates a line that exists in 3D space and is visible in all views of a project.